# GetActiveServerIds Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MultiServerService..::..GetActiveServerIds Method
MultiServerService Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetActiveServerIds()()()() | Returns Ids of the currently active application-level servers registered for the service. |
| GetActiveServerIds(Document) | Returns Ids of the servers currently applicable to the given document for the service. |

# See Also
MultiServerService Class
MultiServerService Members
Autodesk.Revit.DB.ExternalService Namespace